[
  {
    "pattern": "(?i)MongoTimeoutException|MongoTimeoutError|timed out.*connecting to database",
    "title": "MongoDB Connection Timeout",
    "description": "A timeout error occurred during connection to the MongoDB database, commonly due to network latency, incorrect connection strings, firewall restrictions, or server overload.",
    "solution": "Verify the MONGO_URL environment variable for correctness. For replica sets, ensure the connection string is valid and append parameters like '?serverSelectionTimeoutMS=30000&connectTimeoutMS=30000' to extend timeouts. Check network connectivity, firewall rules, and ensure the MongoDB service is running.",
    "source": "https://docs.rocket.chat/docs/additional-mongodb-driver-options"
  },
  {
    "pattern": "(?i)User not found",
    "title": "LDAP: User Not Found",
    "description": "An authentication attempt failed because the user could not be found. This is common in LDAP setups.",
    "solution": "Verify the user's credentials are correct. Check the LDAP 'User Search Filter' in Admin settings to ensure it correctly queries for users (e.g., '(&(objectClass=user)(sAMAccountName=#{user}))'). Enable LDAP synchronization to proactively import users and prevent recurrence.",
    "source": "https://docs.rocket.chat/docs/ldap"
  },
  {
    "pattern": "(?i)Invalid json response body.*Federation",
    "title": "Federation JSON Response Error",
    "description": "The server received an invalid or malformed JSON response when communicating with another federated server.",
    "solution": "This is often an issue with the remote server it's trying to federate with. Check the federation settings and ensure the remote server is healthy and configured correctly. Verify DNS and network connectivity between servers. Note that Matrix Federation is deprecated; consider migrating to native federation.",
    "source": "https://docs.rocket.chat/docs/rocketchat-release-notes"
  },
  {
    "pattern": "(?i)Failed to communicate with Rocket.Chat Cloud",
    "title": "Failure to Communicate with Cloud",
    "description": "The server could not connect to Rocket.Chat's cloud services, which can affect push notifications, marketplace apps, and license validation.",
    "solution": "Verify the server has a stable internet connection and can resolve DNS for 'cloud.rocket.chat'. Check for firewall rules or proxies that might be blocking outbound connections on port 443. Configure proxies in environment variables if needed.",
    "source": "https://docs.rocket.chat/docs/additional-configurations"
  },
  {
    "pattern": "(?i)Input buffer contains unsupported image format",
    "title": "Unsupported Image Format",
    "description": "A user attempted to upload an image file that is not in a supported format (e.g., JPEG, PNG, GIF).",
    "solution": "Check the allowed file types under Admin > File Upload > Accepted Media Types. Ensure the user is uploading a standard image format like JPEG, PNG, or GIF. This error can sometimes indicate a corrupted file; add clear error messages for users as per recent fixes.",
    "source": "https://docs.rocket.chat/docs/rocketchat-release-notes"
  },
  {
    "pattern": "(?i)No real time data received recently",
    "title": "WebSocket Connection Issue",
    "description": "This may indicate a WebSocket connection issue, often resulting in greyed-out messages or lack of real-time updates.",
    "solution": "Ensure that your server supports WebSockets and check any reverse proxy configurations (e.g., Nginx, Apache) to properly forward WebSocket connections. Verify network stability. Test with tools like WebSocket echo servers (e.g., websocket.org/echo.html).",
    "source": "https://forums.rocket.chat/t/messages-greyed-out-error-no-real-time-data-received-recently/20039"
  },
  {
    "pattern": "(?i)Network request failed",
    "title": "Network Request Failed in Mobile App",
    "description": "This error often occurs in mobile apps due to network issues, SSL certificate problems, or proxy misconfigurations.",
    "solution": "Verify that your server's SSL certificate is valid and trusted, ensure the server is reachable from the mobile device, and check for any interfering proxies or firewalls. Test connectivity via mobile browsers to isolate app vs. server problems.",
    "source": "https://forums.rocket.chat/t/network-request-failed-on-mobile-app-for-both-ios-and-android/20766"
  },
  {
    "pattern": "(?i)http request to a https server",
    "title": "Protocol Mismatch Error",
    "description": "There is a protocol mismatch when sending requests, often after server upgrades or configuration changes.",
    "solution": "Update your configuration to use the correct protocol, likely HTTPS if your server is secured. Restart the server after changes. For reverse proxies, add Nginx directives like 'proxy_pass https://backend;' or Apache mods for SSL forwarding.",
    "source": "https://forums.rocket.chat/t/rocket-chat-via-snap-has-error-on-restart-of-the-application/14249"
  },
  {
    "pattern": "(?i)Workspace in read-only mode",
    "title": "Workspace Read-Only Mode",
    "description": "The workspace is in read-only mode, typically due to disconnection from Rocket.Chat cloud services.",
    "solution": "Your workspace needs to be connected to the Rocket.Chat cloud. Admins can restore functionality by registering or connecting via Administration > Workspace > Connectivity Services.",
    "source": "https://docs.rocket.chat/docs/troubleshooting"
  },
  {
    "pattern": "(?i)out of memory|OOM|Killed",
    "title": "Out of Memory Error",
    "description": "Server crashes or stops due to insufficient memory, often after adding swap or on low-RAM setups.",
    "solution": "1. Upgrade to at least 2GB RAM. 2. Disable unnecessary services like snapd. 3. Monitor resource usage with tools like htop and optimize MongoDB caching.",
    "source": "https://forums.rocket.chat/t/rocketchat-server-stopped-running-after-creating-swapfile/11565"
  },
  {
    "pattern": "(?i)Invalid Workspace URL",
    "title": "Invalid Workspace URL Error",
    "description": "Occurs on Android devices when using the mobile app, often related to configuration mismatches.",
    "solution": "Verify the workspace URL in the app settings and server configuration. Ensure consistency between server Site_URL and app connections. Update the app if outdated (e.g., issues fixed in versions post-4.57).",
    "source": "https://forums.rocket.chat/t/rocket-chat-errors-on-android-mobile/21531"
  },
  {
    "pattern": "(?i)Too many login attempts|Too Frequent Login errors",
    "title": "Too Frequent Login Errors",
    "description": "Users encounter login failures due to rate limiting or credential issues on new installations.",
    "solution": "Check for rate limiting in server settings. Verify user credentials and consider resetting passwords. If persistent, review authentication plugins or LDAP configurations. Enable brute-force protection in Administration > Workspace > Settings > Accounts > Login Protection.",
    "source": "https://forums.rocket.chat/t/too-frequent-login-errors/14842"
  },
  {
    "pattern": "(?i)Error: Cannot find module '.*'",
    "title": "Module Not Found Error",
    "description": "This error indicates that a required module is missing from the Node.js environment.",
    "solution": "Ensure all dependencies are installed by running `npm install` or `yarn install`. If the module is a custom one, verify its path and existence in the project. For scoped packages (e.g., @org/module), confirm inclusion in package.json.",
    "source": "https://docs.npmjs.com/cli/commands/npm-install"
  },
  {
    "pattern": "(?i)SyntaxError: Unexpected token",
    "title": "Syntax Error in JavaScript Code",
    "description": "This error occurs when there is a syntax mistake in the JavaScript code, such as a missing bracket or semicolon.",
    "solution": "Review the code for syntax errors. Use a linter like ESLint or a code editor with syntax highlighting to help identify issues.",
    "source": "https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Grammar_and_types"
  }
]